{"recipe_id":"69315e7f-9132-4801-a3ed-e6db805f56f0","name":"Honey Roasted Shrimp and Broccoli","image":"./assets/recipes/images/Hot-Honey-Shrimp-Broccoli.webp","metadata":{"time_added":"Thu Dec 09 2021 20:18:17 GMT-0800 (Pacific Standard Time)","labels":["Shrimp","Broccoli"],"src_url":"#"},"metrics":{"cook_time":"18","prep_time":"15","servings":"4"},"ingredients":["1 cup long grain rice, 3 tablespoons honey, 1 teaspoon red pepper flakes, 1 pound broccoli cut into bite-sized florets, 3 tablespoons olive oil divided, 1 teaspoon kosher salt divided, 1/2 teaspoon freshly ground black pepper, 3 tablespoons hot honey divided, 3 cloves garlic minced, 1 pound uncooked large shrimp peeled and deveined (31/35 size), Red pepper flakes and lime wedges for serving (optional)"],"steps":["Arrange the oven rack and preheat the oven: Arrange a rack in the middle of the oven. Preheat the oven to 400°F. ","Make the rice: Bring a large pot of salted water to a boil over medium-high heat. Add the rice and continue to boil until tender, about 30 minutes. Drain the rice well through a fine-mesh strainer, return the rice to the now-empty pot off the heat, cover, and let steam for 10 minutes.  ","Make the hot honey: While the rice is boiling, make the hot honey. In a small saucepan set over medium-low heat add the honey and red pepper flakes. Heat the hot honey, stirring occasionally, until just warmed through, about 5 minutes. Set aside to infuse while you roast the broccoli. ","Season and roast the broccoli: Place the broccoli on an unlined rimmed baking sheet. Drizzle with 2 tablespoons olive oil, season with 1/2 teaspoon kosher salt and 1/4 teaspoon freshly ground black pepper. Toss to coat and spread broccoli out into an even layer. Roast for 10 minutes. ","Finish making hot honey and season the shrimp with salt and pepper: Meanwhile, in a small bowl, using a whisk, combine 2 tablespoons hot honey, remaining 1 tablespoon olive oil, and the minced garlic. Season the shrimp with the remaining 1/2 teaspoon kosher salt and the remaining 1/4 teaspoon freshly ground black pepper. ","Carefully add shrimp to baking sheet with broccoli: Add the shrimp to the baking sheet, drizzle with the hot honey mixture, and toss to combine with the broccoli. Spread out into an even layer and return to the oven. Continue to roast, stirring both the broccoli and shrimp halfway through, until the shrimp are pink and just opaque and the broccoli is tender and charred in spots, 6 to 8 minutes more. ","Drizzle remaining hot honey, garnish, and serve: Drizzle the remaining 1 tablespoon of hot honey over the shrimp and broccoli before serving over rice. Garnish with additional red pepper flakes and a squeeze of lime juice, if desired. "]}